spike/followup-556/mutants/mut556-sigaction-guard-off.diff
--- a/shim/src/syscalls.zig	2026-09-13 16:15:01
+++ b/shim/src/syscalls.zig	2026-09-13 09:04:42
@@ -748,7 +748,7 @@
 /// wrapper never needs to know what the C library's `struct sigaction` looks like.
 pub fn sigaction(signum: c_int, act: ?*const anyopaque, oldact: ?*anyopaque) callconv(.c) c_int {
     const f = nextSymbol(SigactionFn, "sigaction", &real_sigaction) orelse return -1;
-    if (!guard_signal or signum != sigsys_no or act == null) return f(signum, act, oldact);
+    if (true or !guard_signal or signum != sigsys_no or act == null) return f(signum, act, oldact);
     // The query half is answered by the library, so `oldact` describes the handler that
     // is really installed — including the `SA_SIGINFO` flag that says how to call it, for
     // a caller that means to chain. Only the set half is dropped.
